cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"

# brews
brew "act"
brew "awscli"
brew "aws-sam-cli"
brew "azure-cli"
brew "eksctl"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "hadolint"
brew "helm"
brew "htop"
brew "jq"
brew "kubectx"
brew "k9s"
brew "nvm"
brew "poetry"
brew "ripgrep"
brew "stern"
brew "terragrunt"
brew "tfenv"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yq"

# casks
cask "claude-code"
cask "codeql"
cask "font-noto-nerd-font"
cask "gcloud-cli"
cask "google-cloud-sdk"
cask "ngrok"
