cask_args appdir: "/Applications"
tap "homebrew/cask"

# casks
cask "spotify"
cask "visual-studio-code"

# brews
brew "act"
brew "awscli"
brew "azure-cli"
brew "gh"
brew "git"
brew "go"
brew "gpg"
brew "helm"
brew "jq"
brew "k9s"
brew "nvm"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"

